# St7GetMovingLoadState

Returns the enabled state of the specified moving load path for the analysis.

long St7GetMovingLoadState(long uID, long LoadPathID, bool* Enabled)
Input Parameters
uID
Strand7 model file ID.
LoadPathID
Load path ID.
Output Parameters
Enabled
True if the load path is enabled.